Revit 2026 API

# IFCImportOptionsLinkOrientation Property

---

The orientation of the Linked IFC File in the Host Document.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCLinkOrientation LinkOrientation { get; set; }
```
```vb
Public Property LinkOrientation As IFCLinkOrientation
	Get
	Set
```
```cpp
public:
property IFCLinkOrientation LinkOrientation {
	IFCLinkOrientation get ();
	void set (IFCLinkOrientation value);
}
```
```fsharp
member LinkOrientation : IFCLinkOrientation with get, set
```

#### Property Value

IFCLinkOrientation

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

IFCImportOptions Class

Autodesk.Revit.DB.IFC Namespace